Autodesk.Revit.DB.PaperSourceSet
A set that can contain any number of paper source objects.

Autodesk.Revit.DB.PaperSourceSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.PaperSourceSet.ReverseIterator
Autodesk.Revit.DB.PaperSourceSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.PaperSourceSet.ForwardIterator
Autodesk.Revit.DB.PaperSourceSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.PaperSourceSet.Erase(Autodesk.Revit.DB.PaperSource)
System.Int32
Removes a specified object from the set.
item: The item to be erased.
Returns: The number of items that were erased from the set.

Autodesk.Revit.DB.PaperSourceSet.Contains(Autodesk.Revit.DB.PaperSource)
System.Boolean
Tests for the existence of an item within the set.
item: The item to be searched for.
Returns: The Contains method returns True if the item is within the set, otherwise False.

Autodesk.Revit.DB.PaperSourceSet.Clear
void
Removes every item from the set, rendering it empty.

Autodesk.Revit.DB.PaperSourceSet.Size
System.Int32
get
Returns the number of objects that are in the set.

Autodesk.Revit.DB.PaperSourceSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.